Revit 2026 API

# TextNoteGetFormattedText Method

---

Returns an object that contains text and associated formatting of this note.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FormattedText GetFormattedText()
```
```vb
Public Function GetFormattedText As FormattedText
```
```cpp
public:
FormattedText^ GetFormattedText()
```
```fsharp
member GetFormattedText : unit -> FormattedText
```

#### Return Value

FormattedText The object that contains the text and associated formatting of of the text in this text note.

The returned object is not attached to the text note and modifying it will not modify the contents of the text note. After changes are made to the FormattedText, use SetFormattedText(FormattedText) apply those changes to the TextNote.

#### Reference

TextNote Class

Autodesk.Revit.DB Namespace